Import library 'Seaborn', 'NumPy' dan 'Pandas'

In [7]:
import numpy as np
import seaborn as sns
import pandas as pd

Load dataset 'Titanic'

In [8]:
titanic = sns.load_dataset('titanic')

2.1 Filter out rows where the 'age' column's value is missing then display the first 5 rows.

In [9]:
filtered_data = titanic[titanic['age'].notna()]

print(filtered_data.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

2.2 Retrieve rows where the age is greater than 50 then display the first 5 rows.

In [10]:
age_greater_50 = titanic[titanic['age'] > 50]

print(age_greater_50.head())

    survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
6          0       1    male  54.0      0      0  51.8625        S   First
11         1       1  female  58.0      0      0  26.5500        S   First
15         1       2  female  55.0      0      0  16.0000        S  Second
33         0       2    male  66.0      0      0  10.5000        S  Second
54         0       1    male  65.0      0      1  61.9792        C   First

      who  adult_male deck  embark_town alive  alone
6     man        True    E  Southampton    no   True
11  woman       False    C  Southampton   yes   True
15  woman       False  NaN  Southampton   yes   True
33    man        True  NaN  Southampton    no   True
54    man        True    B    Cherbourg    no  False

2.3 Filter data based on multiple conditions (age > 30 and 'sex' is 'female') then display the first 5 rows.

In [11]:
filtered_conditions = titanic[(titanic['age'] > 30) & (titanic['sex'] == 'female')]

print(filtered_conditions.head())

    survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
1          1       1  female  38.0      1      0  71.2833        C   First
3          1       1  female  35.0      1      0  53.1000        S   First
11         1       1  female  58.0      0      0  26.5500        S   First
15         1       2  female  55.0      0      0  16.0000        S  Second
18         0       3  female  31.0      1      0  18.0000        S   Third

      who  adult_male deck  embark_town alive  alone
1   woman       False    C    Cherbourg   yes  False
3   woman       False    C  Southampton   yes  False
11  woman       False    C  Southampton   yes   True
15  woman       False  NaN  Southampton   yes   True
18  woman       False  NaN  Southampton    no  False

2.4 Sort the dataset based on the 'fare' column in ascending order, then display 5 first rows.

In [12]:
# Urutkan berdasarkan 'Fare' secara ascending
sorted_by_fare = titanic.sort_values(by='fare', ascending=True)

# Tampilkan 5 baris pertama
print(sorted_by_fare.head())

     survived  pclass   sex   age  sibsp  parch  fare embarked   class  who  \
806         0       1  male  39.0      0      0   0.0        S   First  man
413         0       2  male   NaN      0      0   0.0        S  Second  man
481         0       2  male   NaN      0      0   0.0        S  Second  man
466         0       2  male   NaN      0      0   0.0        S  Second  man
179         0       3  male  36.0      0      0   0.0        S   Third  man

     adult_male deck  embark_town alive  alone
806        True    A  Southampton    no   True
413        True  NaN  Southampton    no   True
481        True  NaN  Southampton    no   True
466        True  NaN  Southampton    no   True
179        True  NaN  Southampton    no   True

2.5 Sort the dataset by multiple columns (first by 'class' and then by 'age'), then display 5 first rows.

In [13]:
# Urutkan berdasarkan 'Pclass' dan 'Age'
sorted_by_multiple = titanic.sort_values(by=['pclass', 'age'], ascending=[True, True])

# Tampilkan 5 baris pertama
print(sorted_by_multiple.head())

     survived  pclass     sex    age  sibsp  parch      fare embarked  class  \
305         1       1    male   0.92      1      2  151.5500        S  First
297         0       1  female   2.00      1      2  151.5500        S  First
445         1       1    male   4.00      0      2   81.8583        S  First
802         1       1    male  11.00      1      2  120.0000        S  First
435         1       1  female  14.00      1      2  120.0000        S  First

       who  adult_male deck  embark_town alive  alone
305  child       False    C  Southampton   yes  False
297  child       False    C  Southampton    no  False
445  child       False    A  Southampton   yes  False
802  child       False    B  Southampton   yes  False
435  child       False    B  Southampton   yes  False

2.6 Reset the index of the DataFrame after sorting, then display 5 first rows.

In [14]:
# Reset indeks setelah pengurutan
reset_index_df = sorted_by_multiple.reset_index(drop=True)

# Tampilkan 5 baris pertama
print(reset_index_df.head())

   survived  pclass     sex    age  sibsp  parch      fare embarked  class  \
0         1       1    male   0.92      1      2  151.5500        S  First
1         0       1  female   2.00      1      2  151.5500        S  First
2         1       1    male   4.00      0      2   81.8583        S  First
3         1       1    male  11.00      1      2  120.0000        S  First
4         1       1  female  14.00      1      2  120.0000        S  First

     who  adult_male deck  embark_town alive  alone
0  child       False    C  Southampton   yes  False
1  child       False    C  Southampton    no  False
2  child       False    A  Southampton   yes  False
3  child       False    B  Southampton   yes  False
4  child       False    B  Southampton   yes  False

2.7 Find and display rows where 'embarked' column value is 'C'  (Cherbourg) and 'fare' is within the 90th percentile.

In [15]:
fare_90th_percentile = titanic['fare'].quantile(0.9)

filtered_90th_percentile = titanic[(titanic['embarked'] == 'C') & (titanic['fare'] >= fare_90th_percentile)]

print(filtered_90th_percentile)

     survived  pclass     sex   age  sibsp  parch      fare embarked  class  \
31          1       1  female   NaN      1      0  146.5208        C  First
34          0       1    male  28.0      1      0   82.1708        C  First
118         0       1    male  24.0      0      1  247.5208        C  First
139         0       1    male  24.0      0      0   79.2000        C  First
195         1       1  female  58.0      0      0  146.5208        C  First
215         1       1  female  31.0      1      0  113.2750        C  First
256         1       1  female   NaN      0      0   79.2000        C  First
258         1       1  female  35.0      0      0  512.3292        C  First
291         1       1  female  19.0      1      0   91.0792        C  First
299         1       1  female  50.0      0      1  247.5208        C  First
306         1       1  female   NaN      0      0  110.8833        C  First
307         1       1  female  17.0      1      0  108.9000        C  First
310         1       1  female  24.0      0      0   83.1583        C  First
311         1       1  female  18.0      2      2  262.3750        C  First
319         1       1  female  40.0      1      1  134.5000        C  First
325         1       1  female  36.0      0      0  135.6333        C  First
337         1       1  female  41.0      0      0  134.5000        C  First
373         0       1    male  22.0      0      0  135.6333        C  First
375         1       1  female   NaN      1      0   82.1708        C  First
377         0       1    male  27.0      0      2  211.5000        C  First
380         1       1  female  42.0      0      0  227.5250        C  First
393         1       1  female  23.0      1      0  113.2750        C  First
453         1       1    male  49.0      1      0   89.1042        C  First
484         1       1    male  25.0      1      0   91.0792        C  First
496         1       1  female  54.0      1      0   78.2667        C  First
505         0       1    male  18.0      1      0  108.9000        C  First
537         1       1  female  30.0      0      0  106.4250        C  First
544         0       1    male  50.0      1      0  106.4250        C  First
550         1       1    male  17.0      0      2  110.8833        C  First
557         0       1    male   NaN      0      0  227.5250        C  First
581         1       1  female  39.0      1      1  110.8833        C  First
587         1       1    male  60.0      1      1   79.2000        C  First
591         1       1  female  52.0      1      0   78.2667        C  First
659         0       1    male  58.0      0      2  113.2750        C  First
679         1       1    male  36.0      0      1  512.3292        C  First
698         0       1    male  49.0      1      1  110.8833        C  First
700         1       1  female  18.0      1      0  227.5250        C  First
716         1       1  female  38.0      0      0  227.5250        C  First
737         1       1    male  35.0      0      0  512.3292        C  First
742         1       1  female  21.0      2      2  262.3750        C  First
789         0       1    male  46.0      0      0   79.2000        C  First
835         1       1  female  39.0      1      1   83.1583        C  First
849         1       1  female   NaN      1      0   89.1042        C  First
879         1       1  female  56.0      0      1   83.1583        C  First

       who  adult_male deck embark_town alive  alone
31   woman       False    B   Cherbourg   yes  False
34     man        True  NaN   Cherbourg    no  False
118    man        True    B   Cherbourg    no  False
139    man        True    B   Cherbourg    no   True
195  woman       False    B   Cherbourg   yes   True
215  woman       False    D   Cherbourg   yes  False
256  woman       False  NaN   Cherbourg   yes   True
258  woman       False  NaN   Cherbourg   yes   True
291  woman       False    B   Cherbourg   yes  False
299  woman       False    B   Cherbourg   yes  False
306  woman       False  NaN   Cherbourg   yes   True
307  woman       False    C   Cherbourg   yes  False
310  woman       False    C   Cherbourg   yes   True
311  woman       False    B   Cherbourg   yes  False
319  woman       False    E   Cherbourg   yes  False
325  woman       False    C   Cherbourg   yes   True
337  woman       False    E   Cherbourg   yes   True
373    man        True  NaN   Cherbourg    no   True
375  woman       False  NaN   Cherbourg   yes  False
377    man        True    C   Cherbourg    no  False
380  woman       False  NaN   Cherbourg   yes   True
393  woman       False    D   Cherbourg   yes  False
453    man        True    C   Cherbourg   yes  False
484    man        True    B   Cherbourg   yes  False
496  woman       False    D   Cherbourg   yes  False
505    man        True    C   Cherbourg    no  False
537  woman       False  NaN   Cherbourg   yes   True
544    man        True    C   Cherbourg    no  False
550    man        True    C   Cherbourg   yes  False
557    man        True  NaN   Cherbourg    no   True
581  woman       False    C   Cherbourg   yes  False
587    man        True    B   Cherbourg   yes  False
591  woman       False    D   Cherbourg   yes  False
659    man        True    D   Cherbourg    no  False
679    man        True    B   Cherbourg   yes  False
698    man        True    C   Cherbourg    no  False
700  woman       False    C   Cherbourg   yes  False
716  woman       False    C   Cherbourg   yes   True
737    man        True    B   Cherbourg   yes   True
742  woman       False    B   Cherbourg   yes  False
789    man        True    B   Cherbourg    no   True
835  woman       False    E   Cherbourg   yes  False
849  woman       False    C   Cherbourg   yes  False
879  woman       False    C   Cherbourg   yes  False